Tutoriels/interFoam/mesurePressionOuvrage/constant/waveProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet
{

    alpha            alpha.water;

    waveModel        irregularMultiDirectional;

    nPaddle          1;

    rampTime         2.0;

    activeAbsorption no;

    wavePeriods
    800
    (
(2.468260053622327)
(2.4636639912022034)
(2.4590850133100735)
(2.4545230248624996)
(2.449977931480315)
(2.4454496394821175)
(2.4409380558778326)
(2.436443088362347)
(2.4319646453092134)
(2.4275026357644265)
(2.423056969440264)
(2.4186275567091977)
(2.4142143085978676)
(2.4098171367811285)
(2.405435953576155)
(2.401070671936614)
(2.3967212054468985)
(2.3923874683164263)
(2.3880693753740014)
(2.3837668420622307)
(2.379479784432005)
(2.375208119137042)
(2.370951763428483)
(2.366710635149549)
(2.3624846527302554)
(2.3582737351821823)
(2.3540778020933013)
(2.3498967736228566)
(2.345730570496301)
(2.341579114000284)
(2.337442325977697)
(2.333320128822767)
(2.329212445476205)
(2.3251191994204006)
(2.3210403146746756)
(2.3169757157905804)
(2.3129253278472413)
(2.3088890764467567)
(2.3048668877096445)
(2.3008586882703326)
(2.2968644052726983)
(2.2928839663656535)
(2.2889172996987774)
(2.2849643339179933)
(2.2810249981612873)
(2.2770992220544786)
(2.2731869357070242)
(2.269288069707874)
(2.2654025551213652)
(2.26153032348316)
(2.257671306796222)
(2.2538254375268387)
(2.249992648600682)
(2.2461728733989057)
(2.2423660457542893)
(2.2385720999474144)
(2.234790970702886)
(2.2310225931855854)
(2.227266902996967)
(2.2235238361713896)
(2.2197933291724823)
(2.2160753188895534)
(2.2123697426340287)
(2.2086765381359283)
(2.204995643540381)
(2.201326997404167)
(2.197670538692304)
(2.1940262067746574)
(2.190393941422592)
(2.1867736828056548)
(2.183165371488286)
(2.1795689484265717)
(2.175984354965019)
(2.172411532833368)
(2.1688504241434376)
(2.1653009713859936)
(2.1617631174276575)
(2.1582368055078396)
(2.154721979235702)
(2.151218582587155)
(2.1477265599018778)
(2.1442458558803734)
(2.1407764155810485)
(2.1373181844173215)
(2.133871108154761)
(2.1304351329082523)
(2.1270102051391846)
(2.1235962716526755)
(2.1201932795948126)
(2.116801176449931)
(2.1134199100379054)
(2.11004942851148)
(2.1066896803536164)
(2.1033406143748676)
(2.1000021797107804)
(2.096674325819319)
(2.0933570024783137)
(2.090050159782937)
...
    );

    waveHeights
    800
    (
(0.002684060730058691)
(0.0027182122663997853)
(0.002752380823619609)
(0.002786561055868306)
(0.0028207476611009545)
(0.0028549353827216004)
(0.0028891190111631263)
(0.0029232933854034995)
(0.00295745339441896)
(0.002991593978574746)
(0.0030257101309540497)
(0.003059796898625873)
(0.0030938493838525327)
(0.003127862745237565)
(0.00316183219881486)
(0.0031957530190798457)
(0.0032296205399636084)
(0.0032634301557507776)
(0.0032971773219421666)
(0.0033308575560630563)
(0.003364466438418109)
(0.003397999612793824)
(0.003431452787109612)
(0.0034648217340184344)
(0.0034981022914580373)
(0.003531290363153824)
(0.0035643819190743606)
(0.0035973729958406193)
(0.0036302596970899654)
(0.0036630381937959693)
(0.0036957047245450582)
(0.003728255595771149)
(0.0037606871819492373)
(0.0037929959257490754)
(0.003825178338149926)
(0.0038572309985175314)
(0.003889150554644278)
(0.003920933722753659)
(0.003952577287470039)
(0.0039840781017547655)
(0.004015433086809683)
(0.004046639231949044)
(0.004077693594440817)
(0.004108593299318431)
(0.004139335539163919)
(0.0041699175738634485)
(0.0042003367303362175)
(0.00423059040223765)
(0.004260676049637859)
(0.004290591198676309)
(0.004320333441193582)
(0.00434990043434114)
(0.004379289900170018)
(0.004408499625199288)
(0.004437527459965162)
(0.004466371318551583)
(0.004495029178103146)
(0.004523499078321129)
(0.004551779120943523)
(0.004579867469209695)
(0.004607762347310606)
(0.0046354620398252645)
(0.004662964891144145)
(0.004690269304880319)
(0.004717373743268991)
(0.004744276726556144)
(0.004770976832376939)
(0.0047974726951245635)
(0.004823763005310132)
(0.00484984650891429)
(0.004875722006731141)
(0.004901388353705041)
(0.004926844458260902)
(0.0049520892816285215)
(0.004977121837161505)
(0.005001941189651328)
(0.005026546454636998)
(0.005050936797710903)
(0.005075111433821258)
(0.005099069626571676)
(0.005122810687518294)
(0.005146333975464887)
(0.0051696388957564515)
(0.005192724899571617)
(0.005215591483214325)
(0.005238238187405143)
(0.005260664596572612)
(0.005282870338144974)
(0.005304855081842628)
(0.0053266185389716685)
(0.005348160461718813)
(0.005369480642448055)
(0.00539057891299931)
(0.005411455143989378)
(0.005432109244115493)
(0.005452541159461696)
(0.005472750872808343)
(0.005492738402944934)
...
    );

    wavePhases
    800
    (
(3.3875606288955407)
(5.299613316718148)
(5.393191010747305)
(0.08586151928674535)
(3.4064504757351006)
(5.478420790687314)
(5.186321750503437)
(1.5006118683434688)
(5.939735964120354)
(0.41296481989045786)
(2.595811648663378)
(4.379594851497943)
(4.247501454560052)
(2.55440676201062)
(4.334608290817594)
(5.938229126565416)
(1.309614044633894)
(4.047039303151958)
(0.315784438465362)
(0.9195474925617514)
(1.0768940514969347)
(5.739532321970897)
(4.911683359530649)
(5.905234315995054)
(5.308077563447735)
(5.9628110891891986)
(5.510712720046595)
(1.6534161292911278)
(5.616946496552846)
(4.963386847008445)
(0.8575359969138018)
(6.227363616954486)
(4.572394250580861)
(4.114977588260283)
(3.403697311383885)
(0.27221752424793105)
(3.4870946677761063)
(3.734840532705073)
(6.192517074067023)
(3.095568112876757)
(3.413415445577473)
(3.45590681857626)
(3.279660106897583)
(1.5192904091871522)
(0.9851984737483174)
(4.223386555974451)
(1.1354733291825632)
(0.9841439737953419)
(1.4739411283882844)
(1.8206228448228807)
(5.3634901941691195)
(0.8599051995199402)
(6.269050733993371)
(4.0703471338995705)
(4.389777173586114)
(4.919761792787217)
(4.573083655727757)
(1.2215939012820924)
(1.440937865803768)
(1.935037012008448)
(3.2605373043588597)
(5.258008460366844)
(3.961646425756478)
(4.777514527570045)
(4.433794873355508)
(2.6896942084715656)
(3.4641685675144416)
(3.5292502163265977)
(6.117390332638845)
(1.2893117289924578)
(1.7487347065015677)
(2.4002538961423774)
(2.1804765033092854)
(6.2693353918388715)
(3.365223173161603)
(4.960320986579698)
(3.9315205638308797)
(2.5629263876207635)
(2.9758973305356764)
(1.545830694885578)
(3.6381923441038095)
(6.1414877121833245)
(5.024000536927523)
(3.940101125959224)
(5.198674023072479)
(3.429958968941571)
(3.3999147135979597)
(5.407632530896409)
(6.190901314035558)
(5.62038874703374)
(3.8650959363711475)
(5.428781363763054)
(4.776381647147544)
(5.430796410100083)
(4.4207672199209584)
(5.4248734098494085)
(4.19514994803878)
(5.635783219521996)
...
    );

    waveDirs
    800
    (
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
...
    );

}

outlet
{

    alpha            alpha.water;

    waveModel        shallowWaterAbsorption;

    nPaddle          1;
}
